/*Напишете функцията int atof(char *s), която
преобразува стринг в число с десетична запетая. Тази функция е
подобна на разглежданата по-горе atoi(char *s), само че когато се
стигне до . точката, отделяща цялата част от дробната, трябва
да се пусне още един цикъл, който да изчисли числото в
дробната част по същия начин, както е числото в цялата част.
Само че тук при дробната част трябва да имаме една
променлива, която да умножаваме по 10 всеки път до края на
дробната част power *= 10; Накрая трябва да разделим
полученото число на тази променлива, за да получим реалното
число с плаващата заперая на точното място. */

#include <stdio.h>
#include <ctype.h>

double atof (char *s){
    int i = 0;
    double n = 0;
    double power = 1;
    for (n; isdigit(s[i]); i++)
        n = 10 * n + (s[i] - '0');
    if (s[i] == '.')
    i++;
    for (power; isdigit(s[i]);i++){
        n = 10 * n + (s[i] - '0');
        power *= 10; 
    }
    return n / power;
}

int main(void){
    char str[20] = "123.987";
    double rez = atof(str);
    printf("%f", rez);
    return 0;
}
