/*Напишете програма, която генерира “случайна разходка” из
елементите на двумерен масив от тип char с размер 10 х 10. Преди разходката
всички елементи на масива съдържат символа ‘.’ и след като елемента е
посетен в него се записва поредната буква от латинската азбука т.е. на първия
посетен елемент се записва буквата ‘А’, а нз последния буквата ‘Z’. Програмата
трябва да се разхожда от елемент на елемент в следната последователност:
от елемента, на който е в момента може да се премести един елемент на горе,
на долу, на ляво или на дясно. Не може да се премества на произволна
позиция. Преди всяко преместване проверете дали няма да излезете извън
масива и дали позицията вече не е заета от някоя буква т.е. елемента да е
посетен вече. Ако горните условия са изпълнени се преместете в желатана
посока. Ако всичките 4 дестинации са блокирани вашата програм трябва да
спре.*/

#include <stdio.h>
#include <stdlib.h>

int rand();

int main(){
    char arr[10][10];
    int i,j,n;
    for (i = 0; i < 10; i++){
        for (j = 0; j < 10; j++){
            arr[i][j] = '.';
            printf("arr[%d][%d] : %c\n", i, j, arr[i][j]);
        }
    }
    char letter = 'A';
    arr[0][0] = letter;
    i = 0;
    j = 0;
    int t = 0;
    while (letter <= 'Z'){
        n = rand() % 4;
        t = 0;

        if (n == 1){
            if (i > 0 && arr[i-1][j] != '.'){
                i--;
                letter++;
                arr[i][j] = letter;
            }
            else {
                t++;
                continue;
            }
            
        }
        else if (n == 2){
            if (i < 9 && arr[i+1][j] != '.'){            
                i++;
                letter++;
                arr[i][j] = letter;
            }
            else {
                t++;
                continue;
            }
            
        }
        else if (n == 3){
            if (j > 0 && arr[i][j-1] != '.'){
                j--;
                letter++;
                arr[i][j] = letter;
            }
            else {
                t++;
                continue;
            }
            
        }
        else if (n == 4){
            if (j < 9 && arr[i][j+1] != '.'){
                j++;
                letter++;
                arr[i][j] = letter;
            }
            else {
                t++;
                continue;
            }
            
        }
        if (t == 4) {
            break;
        }
        
    }

    for (i = 0; i < 10; i++){
        for (j = 0; j < 10; j++){
            printf("arr[%d][%d] : %c\n", i, j, arr[i][j]);
        }
    }
    printf("%d", n);
    return 0;
}
