/*Напишете функцията int binarySearch(int a[], int n, int
x), която получава като първи аргумент началото на масив а,
втория аргумент е дължината на масива, а третия аргумент е
числото, което търсим. Знаем, че масива в който ще търсим
елемента е предварително подреден. Сравняваме тъсения
елемент с елемента в средата на масива. Ако той е по голям от
този в средата търсим елемента от средата до края, ако е по-
малък го търсим в частта от началото до средата. Това се
повтаря, докато елемента от масива не стане равен с търсения.
Тогава връщаме номера на който се намира елемента в масива
или -1 ако не се съдържа в масива.*/

#include <stdio.h>

int binarySearch(int a[], int n, int x){
    int l = n / 2;
    int j = 0;
    if (x < a[l]){
        for (int i = 0; i < l; i++){
            if (a[i] == x){
                printf("%d\n", i);
                j++;
            }
        }
    }
    else {
        for (int i = l; i < n; i++){
            if (a[i] == x){
                printf("%d\n", i);
                j++;
            }
        }
    }
    if (j == 0){
        printf("-1\n");
    }
}

int main(){
    int a[10] = {2,5,8,15,17,23,28,32,36,40};
    int x = 8;
    binarySearch(a,10,x);
    return 0;
}
