/*Напишете функцията int linSearch(int a[], int l, int d),
която получава като първи аргумент началото на масив а, втория
аргумент е дължината на масива, а третия аргумент е числото,
което търсим. Претърсете масива елемент по елемент и ако
някой елемент съвпада с търсеното число върнете позицията на
която се намира този елемент. В противен случай върнете – 1.*/

#include <stdio.h>

int linSearch(int a[], int l, int d){
    int j = 0;
    for (int i = 0; i < l; i++){
        if (a[i] == d){
            printf("%d\n", i);
            j++;
        }
    }
    if (j == 0){
        printf("-1\n");
    }
}

int main (){
    int a[10] = {5,8,3,6,4,6,8,2,3,0};
    int d = 8;
    linSearch(a,10,d);
    return 0;
}
