#include <stdio.h>

int main(){
    int x = 10;
    int y = 10;
    int true, false;
    false = x&&y&x<<1;

    /*Първо х се шифтва с един бит наляво (рез. 0b10100);
    след това се извършва побитовото И (рез. 0b00000);
    накрая се извършва логическото И (рез. 0) */
    
    printf("False = %d\n", false);
    true = x&&y^x<<1;
    
    /*Първо х се шифтва с един бит наляво (рез. 0b10100);
    след това се извършва побитовото изключващо ИЛИ (рез. 0b11110);
    накрая се извършва логическото И (рез. 1) */
    
    printf("True = %d\n", true);

    return 0;
}
