#include <stdio.h>

int main(){
    int x=1, y=0;
    int z =y||x;
    
    printf("%d\n", z);
    printf("\nInit values: X=%d, Y=%d\n", x,y);
    
    x=1+2,2*3,3+4;
    /*Първо ще се изпълни 3+4, след това 2*3 и 
    накрая ще се изпълни 1+2 и резултата 3 ще се 
    присвои на х */

    y=(7*8,8+9,9-4);
    /*Тук най-висок приоритет имат скобите и 
    затова първо ще се изпълни 7*8, след това
    8+9 и накрая 9-4 и резултата 5 ще се 
    присвои на у */
    
    printf("\nX=%d,Y=%d\n",x,y);

    return 0;
}
