/*Първата функция strcpy(s, t), която копира низа t в низа s. Щеше да е
чудесно просто да кажем s = t, но по този начин ще копираме указателите, а
не всички символи от единия в другия масив. За да стане това трябва да
обходим целия масив символ по символ и като използваме цикъл и да
присвоим стойността всеки един елемент от единия масив на същата
позиция в другия.
Опитайте да го направите сами:*/

#include <stdio.h>

void our_strcpy(char *s, char *t){
    for ( ;(*s = *t) != '\0';s++,t++);
}

int main(){
    char s[] = "Hello world";
    char t[] = "test";
    our_strcpy(s,t);
    printf("%s\n", s);
    printf("%s\n", t);
    return 0;
}

